bench/custom/logs/fuse/ramdisk/fsync/fuse_write_0-1.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=170470: Thu May 30 00:53:57 2024
  write: IOPS=209k, BW=818MiB/s (858MB/s)(32.0GiB/40047msec); 0 zone resets
    clat (usec): min=11, max=144338, avg=130.40, stdev=136.85
     lat (usec): min=11, max=144338, avg=130.48, stdev=137.10
    clat percentiles (usec):
     |  1.00th=[   25],  5.00th=[   46], 10.00th=[   79], 20.00th=[  100],
     | 30.00th=[  112], 40.00th=[  122], 50.00th=[  131], 60.00th=[  141],
     | 70.00th=[  151], 80.00th=[  163], 90.00th=[  184], 95.00th=[  200],
     | 99.00th=[  233], 99.50th=[  245], 99.90th=[  285], 99.95th=[  306],
     | 99.99th=[  424]
   bw (  KiB/s): min=774680, max=1827722, per=100.00%, avg=880140.22, stdev=7846.98, samples=2391
   iops        : min=193670, max=456930, avg=220034.94, stdev=1961.74, samples=2391
  lat (usec)   : 20=0.34%, 50=5.54%, 100=14.18%, 250=79.54%, 500=0.39%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 250=0.01%
  fsync/fdatasync/sync_file_range:
    sync (usec): min=5, max=44986, avg=102.07, stdev=65.52
    sync percentiles (usec):
     |  1.00th=[   19],  5.00th=[   37], 10.00th=[   56], 20.00th=[   75],
     | 30.00th=[   85], 40.00th=[   94], 50.00th=[  102], 60.00th=[  111],
     | 70.00th=[  120], 80.00th=[  131], 90.00th=[  147], 95.00th=[  161],
     | 99.00th=[  198], 99.50th=[  210], 99.90th=[  243], 99.95th=[  262],
     | 99.99th=[  351]
  cpu          : usr=0.95%, sys=5.69%, ctx=9459844, majf=0, minf=364
  IO depths    : 1=112.5%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,1048544 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=818MiB/s (858MB/s), 818MiB/s-818MiB/s (858MB/s-858MB/s), io=32.0GiB (34.4GB), run=40047-40047msec