bench/custom/logs/fuse/ramdisk/fsync/fuse_write_0-15.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=195543: Thu May 30 00:58:49 2024
  write: IOPS=403k, BW=1575MiB/s (1651MB/s)(32.0GiB/20807msec); 0 zone resets
    clat (usec): min=11, max=4314, avg=70.40, stdev=17.78
     lat (usec): min=11, max=4314, avg=70.51, stdev=17.78
    clat percentiles (usec):
     |  1.00th=[   45],  5.00th=[   54], 10.00th=[   58], 20.00th=[   62],
     | 30.00th=[   65], 40.00th=[   67], 50.00th=[   69], 60.00th=[   71],
     | 70.00th=[   73], 80.00th=[   76], 90.00th=[   82], 95.00th=[   92],
     | 99.00th=[  143], 99.50th=[  172], 99.90th=[  243], 99.95th=[  273],
     | 99.99th=[  343]
   bw (  MiB/s): min= 1520, max= 1705, per=100.00%, avg=1576.20, stdev= 0.94, samples=1312
   iops        : min=389358, max=436506, avg=403508.20, stdev=240.72, samples=1312
  lat (usec)   : 20=0.02%, 50=2.76%, 100=93.61%, 250=3.53%, 500=0.08%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  fsync/fdatasync/sync_file_range:
    sync (usec): min=8, max=1145, avg=64.56, stdev=17.03
    sync percentiles (usec):
     |  1.00th=[   39],  5.00th=[   48], 10.00th=[   52], 20.00th=[   57],
     | 30.00th=[   59], 40.00th=[   61], 50.00th=[   63], 60.00th=[   65],
     | 70.00th=[   67], 80.00th=[   70], 90.00th=[   75], 95.00th=[   85],
     | 99.00th=[  135], 99.50th=[  163], 99.90th=[  235], 99.95th=[  265],
     | 99.99th=[  330]
  cpu          : usr=2.56%, sys=10.24%, ctx=9437420, majf=0, minf=526
  IO depths    : 1=112.5%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,1048544 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1575MiB/s (1651MB/s), 1575MiB/s-1575MiB/s (1651MB/s-1651MB/s), io=32.0GiB (34.4GB), run=20807-20807msec