bench/custom/logs/fuse/ramdisk/fsync/fuse_write_0-7.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=170741: Thu May 30 00:57:12 2024
  write: IOPS=579k, BW=2260MiB/s (2370MB/s)(32.0GiB/14499msec); 0 zone resets
    clat (usec): min=11, max=3328, avg=45.46, stdev=16.39
     lat (usec): min=11, max=3329, avg=45.53, stdev=16.40
    clat percentiles (usec):
     |  1.00th=[   19],  5.00th=[   29], 10.00th=[   32], 20.00th=[   35],
     | 30.00th=[   38], 40.00th=[   40], 50.00th=[   42], 60.00th=[   45],
     | 70.00th=[   49], 80.00th=[   56], 90.00th=[   64], 95.00th=[   73],
     | 99.00th=[   99], 99.50th=[  117], 99.90th=[  172], 99.95th=[  196],
     | 99.99th=[  253]
   bw (  MiB/s): min= 2173, max= 3142, per=100.00%, avg=2411.94, stdev= 7.71, samples=840
   iops        : min=556369, max=804412, avg=617456.43, stdev=1974.74, samples=840
  lat (usec)   : 20=1.41%, 50=70.41%, 100=27.23%, 250=0.94%, 500=0.01%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  fsync/fdatasync/sync_file_range:
    sync (usec): min=7, max=2903, avg=40.64, stdev=16.19
    sync percentiles (usec):
     |  1.00th=[   13],  5.00th=[   24], 10.00th=[   28], 20.00th=[   31],
     | 30.00th=[   33], 40.00th=[   35], 50.00th=[   38], 60.00th=[   41],
     | 70.00th=[   45], 80.00th=[   50], 90.00th=[   59], 95.00th=[   67],
     | 99.00th=[   94], 99.50th=[  112], 99.90th=[  167], 99.95th=[  192],
     | 99.99th=[  249]
  cpu          : usr=3.16%, sys=16.69%, ctx=9520965, majf=0, minf=355
  IO depths    : 1=112.5%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,1048544 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2260MiB/s (2370MB/s), 2260MiB/s-2260MiB/s (2370MB/s-2370MB/s), io=32.0GiB (34.4GB), run=14499-14499msec