bench/custom/logs/fuse/ramdisk/fsync/fuse_write_0.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=170294: Thu May 30 00:52:01 2024
  write: IOPS=111k, BW=434MiB/s (455MB/s)(32.0GiB/75560msec); 0 zone resets
    clat (usec): min=10, max=47931, avg=261.15, stdev=126.18
     lat (usec): min=10, max=47931, avg=261.25, stdev=126.66
    clat percentiles (usec):
     |  1.00th=[  139],  5.00th=[  190], 10.00th=[  204], 20.00th=[  221],
     | 30.00th=[  235], 40.00th=[  245], 50.00th=[  258], 60.00th=[  269],
     | 70.00th=[  281], 80.00th=[  297], 90.00th=[  326], 95.00th=[  355],
     | 99.00th=[  408], 99.50th=[  433], 99.90th=[  510], 99.95th=[  553],
     | 99.99th=[  783]
   bw (  KiB/s): min=432400, max=658844, per=100.00%, avg=445771.99, stdev=692.76, samples=4784
   iops        : min=108100, max=164710, avg=111442.92, stdev=173.18, samples=4784
  lat (usec)   : 20=0.18%, 50=0.44%, 100=0.15%, 250=43.06%, 500=56.05%
  lat (usec)   : 750=0.10%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  fsync/fdatasync/sync_file_range:
    sync (usec): min=4, max=32528, avg=197.40, stdev=75.58
    sync percentiles (usec):
     |  1.00th=[   93],  5.00th=[  130], 10.00th=[  143], 20.00th=[  161],
     | 30.00th=[  174], 40.00th=[  186], 50.00th=[  198], 60.00th=[  208],
     | 70.00th=[  219], 80.00th=[  233], 90.00th=[  251], 95.00th=[  269],
     | 99.00th=[  314], 99.50th=[  338], 99.90th=[  424], 99.95th=[  474],
     | 99.99th=[  685]
  cpu          : usr=0.52%, sys=2.62%, ctx=9455967, majf=0, minf=402
  IO depths    : 1=112.5%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,1048544 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=434MiB/s (455MB/s), 434MiB/s-434MiB/s (455MB/s-455MB/s), io=32.0GiB (34.4GB), run=75560-75560msec