bench/custom/logs/fuse/ramdisk/fsync/fuse_write_ramdisk_none.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=73386: Thu May 30 03:45:26 2024
  write: IOPS=549k, BW=2144MiB/s (2248MB/s)(32.0GiB/15284msec); 0 zone resets
    clat (usec): min=12, max=4242, avg=50.85, stdev=16.67
     lat (usec): min=12, max=4242, avg=51.04, stdev=16.68
    clat percentiles (usec):
     |  1.00th=[   31],  5.00th=[   39], 10.00th=[   41], 20.00th=[   43],
     | 30.00th=[   45], 40.00th=[   46], 50.00th=[   48], 60.00th=[   49],
     | 70.00th=[   51], 80.00th=[   54], 90.00th=[   70], 95.00th=[   79],
     | 99.00th=[  110], 99.50th=[  126], 99.90th=[  169], 99.95th=[  190],
     | 99.99th=[  253]
   bw (  MiB/s): min= 1888, max= 2547, per=100.00%, avg=2163.60, stdev= 4.12, samples=951
   iops        : min=483480, max=652146, avg=553880.38, stdev=1055.59, samples=951
  lat (usec)   : 20=0.12%, 50=68.01%, 100=30.12%, 250=1.73%, 500=0.01%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  fsync/fdatasync/sync_file_range:
    sync (usec): min=8, max=2418, avg=44.29, stdev=16.13
    sync percentiles (usec):
     |  1.00th=[   25],  5.00th=[   34], 10.00th=[   36], 20.00th=[   38],
     | 30.00th=[   39], 40.00th=[   40], 50.00th=[   41], 60.00th=[   42],
     | 70.00th=[   44], 80.00th=[   47], 90.00th=[   62], 95.00th=[   72],
     | 99.00th=[  101], 99.50th=[  118], 99.90th=[  159], 99.95th=[  178],
     | 99.99th=[  253]
  cpu          : usr=3.60%, sys=21.23%, ctx=9440067, majf=0, minf=826
  IO depths    : 1=112.5%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,1048544 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2144MiB/s (2248MB/s), 2144MiB/s-2144MiB/s (2248MB/s-2248MB/s), io=32.0GiB (34.4GB), run=15284-15284msec